xml/Enums/ИИА_ТипДиалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ИИА_ТипДиалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Агент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспознаваниеДокументов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Enums/ИИА_АвторСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИИА_АвторСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Система</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Enums/ИИА_ТипСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ИИА_ТипСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/CommonModules/ИИА_Тесты/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция СформироватьРезультатТеста(Успех, Сообщение, Детали = Неопределено)
	Результат = Новый Структура;
	Результат.Вставить("Успех", Успех);
	Результат.Вставить("Сообщение", Сообщение);
	Результат.Вставить("Детали", ?(Детали = Неопределено, Новый Массив, Детали));
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Запускает бесплатные тесты (без вызова ИИ). По умолчанию для run_tests.py.
//
// Возвращаемое значение:
//  Массив из Структура - каждый элемент: Успех, Сообщение, Детали, ИмяТеста
//
Функция ЗапуститьБесплатныеТесты() Экспорт
	Тесты = Новый Массив;
	Тесты.Добавить("ТестСохраненияИЧтенияКонтекстаDSL");
	Тесты.Добавить("ТестCreateReferenceSetFieldМеждуВызовами");
	Тесты.Добавить("ТестRunQuery");
	Тесты.Добавить("ТестВалидацииDSL");
	Тесты.Добавить("ТестSaveToStorageLoadFromStorage");
	Тесты.Добавить("ТестРежимЗапрос1С");
	Тесты.Добавить("ТестGetMetadata");
	Тесты.Добавить("ТестFindReferenceByName");
	Тесты.Добавить("ТестЛогированияДиалога");
	Тесты.Добавить("ТестСозданияОбъекта");
	Тесты.Добавить("ТестПромптаДополненияПлана");
	Тесты.Добавить("ТестКонтекстИзРегистраДляДополнения");
	Тесты.Добавить("ТестПромптаСозданияПланаСКонтекстом");
	Тесты.Добавить("ТестСобратьФактыПоследнихДействий");
	Тесты.Добавить("ТестСозданиеИИзменениеОбъекта");
	Возврат ЗапуститьНаборТестов(Тесты);
КонецФункции

// Запускает тесты с реальным вызовом ИИ (медленные, требуют API).
//
// Возвращаемое значение:
//  Массив из Структура - каждый элемент: Успех, Сообщение, Детали, ИмяТеста
//
Функция ЗапуститьТестыСИИ() Экспорт
	Тесты = Новый Массив;
	Тесты.Добавить("ТестСоздатьДиалогИВыполнитьАгентаСинхронно");
	Возврат ЗапуститьНаборТестов(Тесты);
КонецФункции

// Запускает тесты в режиме холостого хода (без реального вызова ИИ, с mock-ответами).
//
// Возвращаемое значение:
//  Массив из Структура - каждый элемент: Успех, Сообщение, Детали, ИмяТеста
//
Функция ЗапуститьТестыХолостойХод() Экспорт
	Тесты = Новый Массив;
	Тесты.Добавить("ТестПромптаДополненияПлана");
	Тесты.Добавить("ТестЛоговПослеДополненияПлана");
	Тесты.Добавить("ТестДополнениеПланаСКонтекстомОбъекта");
	Тесты.Добавить("ТестКонтекстИзРегистраДляДополнения");
	Тесты.Добавить("ТестПромптаСозданияПланаСКонтекстом");
	Тесты.Добавить("ТестСобратьФактыПоследнихДействий");
	Тесты.Добавить("ТестСозданиеИИзменениеОбъекта");
	Тесты.Добавить("ТестПолныйЦиклАгентаХолостойХод");
	Возврат ЗапуститьНаборТестов(Тесты);
КонецФункции

// Запускает все тесты (бесплатные + с вызовом ИИ).
//
// Возвращаемое значение:
//  Массив из Структура - каждый элемент: Успех, Сообщение, Детали, ИмяТеста
//
Функция ЗапуститьВсеТесты() Экспорт
	Тесты = Новый Массив;
	Тесты.Добавить("ТестСохраненияИЧтенияКонтекстаDSL");
	Тесты.Добавить("ТестCreateReferenceSetFieldМеждуВызовами");
	Тесты.Добавить("ТестRunQuery");
	Тесты.Добавить("ТестВалидацииDSL");
	Тесты.Добавить("ТестSaveToStorageLoadFromStorage");
	Тесты.Добавить("ТестРежимЗапрос1С");
	Тесты.Добавить("ТестGetMetadata");
	Тесты.Добавить("ТестFindReferenceByName");
	Тесты.Добавить("ТестЛогированияДиалога");
	Тесты.Добавить("ТестСозданияОбъекта");
	Тесты.Добавить("ТестСоздатьДиалогИВыполнитьАгентаСинхронно");
	Возврат ЗапуститьНаборТестов(Тесты);
КонецФункции

Функция ЗапуститьНаборТестов(Тесты)
	Результаты = Новый Массив;
	Для Каждого ИмяТеста Из Тесты Цикл
		РезультатТеста = ВыполнитьТест(ИмяТеста);
		РезультатТеста.Вставить("ИмяТеста", ИмяТеста);
		Результаты.Добавить(РезультатТеста);
	КонецЦикла;
	Возврат Результаты;
КонецФункции

Функция ВыполнитьТест(ИмяТеста)
	Попытка
		Если ИмяТеста = "ТестСохраненияИЧтенияКонтекстаDSL" Тогда
			Возврат ТестСохраненияИЧтенияКонтекстаDSL();
		ИначеЕсли ИмяТеста = "ТестCreateReferenceSetFieldМеждуВызовами" Тогда
			Возврат ТестCreateReferenceSetFieldМеждуВызовами();
		ИначеЕсли ИмяТеста = "ТестRunQuery" Тогда
			Возврат ТестRunQuery();
		ИначеЕсли ИмяТеста = "ТестВалидацииDSL" Тогда
			Возврат ТестВалидацииDSL();
		ИначеЕсли ИмяТеста = "ТестSaveToStorageLoadFromStorage" Тогда
			Возврат ТестSaveToStorageLoadFromStorage();
		ИначеЕсли ИмяТеста = "ТестРежимЗапрос1С" Тогда
			Возврат ТестРежимЗапрос1С();
		ИначеЕсли ИмяТеста = "ТестСоздатьДиалогИВыполнитьАгентаСинхронно" Тогда
			Возврат ТестСоздатьДиалогИВыполнитьАгентаСинхронно();
		ИначеЕсли ИмяТеста = "ТестGetMetadata" Тогда
			Возврат ТестGetMetadata();
		ИначеЕсли ИмяТеста = "ТестFindReferenceByName" Тогда
			Возврат ТестFindReferenceByName();
		ИначеЕсли ИмяТеста = "ТестЛогированияДиалога" Тогда
			Возврат ТестЛогированияДиалога();
		ИначеЕсли ИмяТеста = "ТестСозданияОбъекта" Тогда
			Возврат ТестСозданияОбъекта();
		ИначеЕсли ИмяТеста = "ТестПромптаДополненияПлана" Тогда
			Возврат ТестПромптаДополненияПлана();
		ИначеЕсли ИмяТеста = "ТестЛоговПослеДополненияПлана" Тогда
			Возврат ТестЛоговПослеДополненияПлана();
		ИначеЕсли ИмяТеста = "ТестДополнениеПланаСКонтекстомОбъекта" Тогда
			Возврат ТестДополнениеПланаСКонтекстомОбъекта();
		ИначеЕсли ИмяТеста = "ТестКонтекстИзРегистраДляДополнения" Тогда
			Возврат ТестКонтекстИзРегистраДляДополнения();
		ИначеЕсли ИмяТеста = "ТестПромптаСозданияПланаСКонтекстом" Тогда
			Возврат ТестПромптаСозданияПланаСКонтекстом();
		ИначеЕсли ИмяТеста = "ТестСобратьФактыПоследнихДействий" Тогда
			Возврат ТестСобратьФактыПоследнихДействий();
		ИначеЕсли ИмяТеста = "ТестСозданиеИИзменениеОбъекта" Тогда
			Возврат ТестСозданиеИИзменениеОбъекта();
		ИначеЕсли ИмяТеста = "ТестПолныйЦиклАгентаХолостойХод" Тогда
			Возврат ТестПолныйЦиклАгентаХолостойХод();
		Иначе
			Возврат СформироватьРезультатТеста(Ложь, "Неизвестный тест: " + ИмяТеста);
		КонецЕсли;
	Исключение
		Возврат СформироватьРезультатТеста(Ложь, "Ошибка вызова: " + ОписаниеОшибки());
	КонецПопытки;
КонецФункции

// Тест сохранения и чтения контекста DSL между шагами в рамках одного элемента справочника ИИА_Диалоги.
// Проверяет: запись в регистр ИИА_ДанныеДиалогов, чтение, восстановление ссылки и объекта, очистку контекста.
//
// Возвращаемое значение:
//  Структура:
//   * Успех - Булево - успешность теста
//   * Сообщение - Строка - краткое сообщение
//   * Детали - Массив из Строка - этапы выполнения
//
Функция ТестСохраненияИЧтенияКонтекстаDSL() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("Сообщение", "");
	Результат.Вставить("Детали", Новый Массив);
	
	Попытка
		
		// 1. Создать диалог
		СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог("Администратор", Перечисления.ИИА_ТипДиалога.Агент);
		Результат.Детали.Добавить("Создан диалог: " + СсылкаДиалога);
		
		Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
			Результат.Сообщение = "Не удалось создать диалог";
			Возврат Результат;
		КонецЕсли;
		
		// 2. Подготовить контекст DSL
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("DSL_СсылкаОбъекта", СсылкаДиалога);
		СтруктураДанных.Вставить("DSL_ТипОбъекта", "Справочник");
		СтруктураДанных.Вставить("DSL_ИмяОбъекта", "ИИА_Диалоги");
		Результат.Детали.Добавить("Подготовлен контекст: DSL_СсылкаОбъекта, DSL_ТипОбъекта, DSL_ИмяОбъекта");
		
		// 3. Сохранить в регистр
		ИИА_Сервер.ЗаписатьДанныеДиалогаВРегистр(СсылкаДиалога, СтруктураДанных);
		Результат.Детали.Добавить("Контекст записан в регистр ИИА_ДанныеДиалогов");
		
		// 4. Прочитать из регистра
		Прочитан = ИИА_Сервер.ПолучитьДанныеДиалогаИзРегистра(СсылкаДиалога);
		Результат.Детали.Добавить("Контекст прочитан из регистра");
		
		// 5. Проверки
		Если Прочитан = Неопределено ИЛИ ТипЗнч(Прочитан) <> Тип("Структура") Тогда
			Результат.Сообщение = "Прочитанные данные не являются структурой";
			Возврат Результат;
		КонецЕсли;
		
		Если НЕ Прочитан.Свойство("DSL_СсылкаОбъекта") Тогда
			Результат.Сообщение = "Ключ DSL_СсылкаОбъекта отсутствует в прочитанных данных";
			Возврат Результат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Прочитан.DSL_СсылкаОбъекта) Тогда
			Результат.Сообщение = "DSL_СсылкаОбъекта пустой";
			Возврат Результат;
		КонецЕсли;
		
		Если Прочитан.DSL_СсылкаОбъекта <> СсылкаДиалога Тогда
			Результат.Сообщение = "DSL_СсылкаОбъекта не совпадает с сохранённой ссылкой";
			Возврат Результат;
		КонецЕсли;
		
		Если НЕ Прочитан.Свойство("DSL_ТипОбъекта") ИЛИ Прочитан.DSL_ТипОбъекта <> "Справочник" Тогда
			Результат.Сообщение = "DSL_ТипОбъекта не совпадает (ожидается 'Справочник')";
			Возврат Результат;
		КонецЕсли;
		
		Если НЕ Прочитан.Свойство("DSL_ИмяОбъекта") ИЛИ Прочитан.DSL_ИмяОбъекта <> "ИИА_Диалоги" Тогда
			Результат.Сообщение = "DSL_ИмяОбъекта не совпадает (ожидается 'ИИА_Диалоги')";
			Возврат Результат;
		КонецЕсли;
		
		Объект = Прочитан.DSL_СсылкаОбъекта.ПолучитьОбъект();
		Если Объект = Неопределено Тогда
			Результат.Сообщение = "Не удалось получить объект по DSL_СсылкаОбъекта";
			Возврат Результат;
		КонецЕсли;
		Результат.Детали.Добавить("Проверки пройдены: ссылка, тип, имя, объект восстановлен");
		
		// 6. Очистить контекст
		ИИА_Сервер.ОчиститьКонтекстDSLДиалога(СсылкаДиалога);
		Результат.Детали.Добавить("Контекст DSL очищен");
		
		// 7. Проверить очистку
		ПослеОчистки = ИИА_Сервер.ПолучитьДанныеДиалогаИзРегистра(СсылкаДиалога);
		Если ПослеОчистки <> Неопределено И ТипЗнч(ПослеОчистки) = Тип("Структура") И ПослеОчистки.Свойство("DSL_СсылкаОбъекта") Тогда
			Результат.Сообщение = "DSL_СсылкаОбъекта остался после очистки";
			Возврат Результат;
		КонецЕсли;
		Результат.Детали.Добавить("Очистка проверена: DSL_СсылкаОбъекта отсутствует");
		
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден успешно";
		
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Тест цепочки CreateReference → SetField между двумя вызовами DSL (контекст передаётся через регистр).
//
Функция ТестCreateReferenceSetFieldМеждуВызовами() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог("Администратор", Перечисления.ИИА_ТипДиалога.Агент);
		Результат.Детали.Добавить("Создан диалог: " + СсылкаДиалога);
		Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
			Результат.Сообщение = "Не удалось создать диалог";
			Возврат Результат;
		КонецЕсли;
		
		// Вызов 1: CreateReference + SetField + Write (Write нужен для получения валидной ссылки в контексте)
		DSL1 = "{""steps"":[{""action"":""CreateReference"",""object_name"":""Контрагенты""},{""action"":""SetField"",""field_name"":""Наименование"",""value"":""Тест_Контекст""},{""action"":""Write""}]}";
		Рез1 = ИИА_Сервер.ВыполнитьDSLСценарийБезСообщений(DSL1, СсылкаДиалога);
		Результат.Детали.Добавить("Вызов 1 CreateReference+SetField+Write: Успех=" + Рез1.Успех);
		Если НЕ Рез1.Успех Тогда
			Результат.Сообщение = "CreateReference не выполнен: " + Рез1.Сообщение;
			Возврат Результат;
		КонецЕсли;
		
		// Вызов 2: SetField (контекст должен восстановиться из регистра)
		DSL2 = "{""steps"":[{""action"":""SetField"",""field_name"":""Наименование"",""value"":""Тест_Обновлено""}]}";
		Рез2 = ИИА_Сервер.ВыполнитьDSLСценарийБезСообщений(DSL2, СсылкаДиалога);
		Результат.Детали.Добавить("Вызов 2 SetField: Успех=" + Рез2.Успех);
		Если НЕ Рез2.Успех Тогда
			Результат.Сообщение = "SetField не выполнен (контекст не восстановился?): " + Рез2.Сообщение;
			Возврат Результат;
		КонецЕсли;
		
		// Вызов 3: Write для сохранения
		DSL3 = "{""steps"":[{""action"":""Write""}]}";
		Рез3 = ИИА_Сервер.ВыполнитьDSLСценарийБезСообщений(DSL3, СсылкаДиалога);
		Результат.Детали.Добавить("Вызов 3 Write: Успех=" + Рез3.Успех);
		Если НЕ Рез3.Успех Тогда
			Результат.Сообщение = "Write не выполнен: " + Рез3.Сообщение;
			Возврат Результат;
		КонецЕсли;
		
		ИИА_Сервер.ОчиститьКонтекстDSLДиалога(СсылкаДиалога);
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: CreateReference → SetField → Write между вызовами";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест выполнения простого запроса RunQuery.
//
Функция ТестRunQuery() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		DSL = "{""steps"":[{""action"":""RunQuery"",""query"":""ВЫБРАТЬ 1 КАК Н""}]}";
		Рез = ИИА_DSL.ВыполнитьDSL(DSL, Неопределено, Ложь);
		Результат.Детали.Добавить("Выполнен RunQuery ВЫБРАТЬ 1 КАК Н");
		Если НЕ Рез.Успех Тогда
			Результат.Сообщение = "RunQuery не выполнен: " + Рез.Сообщение;
			Возврат Результат;
		КонецЕсли;
		Если Рез.Результаты.Количество() = 0 Тогда
			Результат.Сообщение = "Нет результатов шага";
			Возврат Результат;
		КонецЕсли;
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: RunQuery выполнен";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест валидации DSL (ПроверитьDSLСценарий).
//
Функция ТестВалидацииDSL() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		// Корректный DSL
		ВалидныйDSL = "{""steps"":[{""action"":""RunQuery"",""query"":""ВЫБРАТЬ 1""}]}";
		РезВалид = ИИА_Сервер.ПроверитьDSLСценарий(ВалидныйDSL);
		Результат.Детали.Добавить("Валидный DSL: Успех=" + РезВалид.Успех);
		Если НЕ РезВалид.Успех Тогда
			Результат.Сообщение = "Валидный DSL не прошёл: " + РезВалид.Сообщение;
			Возврат Результат;
		КонецЕсли;
		
		// CreateReference без object_name
		НевалидныйDSL = "{""steps"":[{""action"":""CreateReference""}]}";
		РезНевалид = ИИА_Сервер.ПроверитьDSLСценарий(НевалидныйDSL);
		Результат.Детали.Добавить("CreateReference без object_name: Успех=" + РезНевалид.Успех + " (ожидается Ложь)");
		Если РезНевалид.Успех Тогда
			Результат.Сообщение = "Невалидный DSL прошёл валидацию";
			Возврат Результат;
		КонецЕсли;
		
		// Неизвестное действие
		НеизвестныйDSL = "{""steps"":[{""action"":""UnknownAction""}]}";
		РезНеизв = ИИА_Сервер.ПроверитьDSLСценарий(НеизвестныйDSL);
		Результат.Детали.Добавить("Неизвестное действие: Успех=" + РезНеизв.Успех + " (ожидается Ложь)");
		Если РезНеизв.Успех Тогда
			Результат.Сообщение = "Неизвестное действие прошло валидацию";
			Возврат Результат;
		КонецЕсли;
		
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: валидация DSL работает";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест SaveToStorage и LoadFromStorage через DSL.
//
Функция ТестSaveToStorageLoadFromStorage() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог("Администратор", Перечисления.ИИА_ТипДиалога.Агент);
		Результат.Детали.Добавить("Создан диалог");
		Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
			Результат.Сообщение = "Не удалось создать диалог";
			Возврат Результат;
		КонецЕсли;
		
		КлючТест = "ТестКлюч_" + Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMddHHmmss");
		ЗначениеТест = "Значение_" + КлючТест;
		
		ЗначениеЭкранир = СтрЗаменить(ЗначениеТест, "\", "\\");
		ЗначениеЭкранир = СтрЗаменить(ЗначениеЭкранир, """", "\""");
		DSLЗапись = "{""steps"":[{""action"":""SaveToStorage"",""key"":""" + КлючТест + """,""data"":""" + ЗначениеЭкранир + """}]}";
		РезЗапись = ИИА_Сервер.ВыполнитьDSLСценарийБезСообщений(DSLЗапись, СсылкаДиалога);
		Результат.Детали.Добавить("SaveToStorage: Успех=" + РезЗапись.Успех);
		Если НЕ РезЗапись.Успех Тогда
			Результат.Сообщение = "SaveToStorage не выполнен: " + РезЗапись.Сообщение;
			Возврат Результат;
		КонецЕсли;
		
		DSLЧтение = "{""steps"":[{""action"":""LoadFromStorage"",""key"":""" + КлючТест + """}]}";
		РезЧтение = ИИА_Сервер.ВыполнитьDSLСценарийБезСообщений(DSLЧтение, СсылкаДиалога);
		Результат.Детали.Добавить("LoadFromStorage: Успех=" + РезЧтение.Успех);
		Если НЕ РезЧтение.Успех Тогда
			Результат.Сообщение = "LoadFromStorage не выполнен: " + РезЧтение.Сообщение;
			Возврат Результат;
		КонецЕсли;
		Если РезЧтение.Результаты.Количество() > 0 Тогда
			РезШага = РезЧтение.Результаты[0];
			Если РезШага.Свойство("Данные") И Строка(РезШага.Данные) = ЗначениеТест Тогда
				Результат.Детали.Добавить("Прочитанное значение совпадает");
			КонецЕсли;
		КонецЕсли;
		
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: SaveToStorage/LoadFromStorage";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест режима «только чтение» (Запрос1С): SetField должен быть запрещён.
//
Функция ТестРежимЗапрос1С() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог("Администратор", Перечисления.ИИА_ТипДиалога.Запрос1С);
		Результат.Детали.Добавить("Создан диалог типа Запрос1С");
		Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
			Результат.Сообщение = "Не удалось создать диалог";
			Возврат Результат;
		КонецЕсли;
		
		// RunQuery разрешён
		DSLЗапрос = "{""steps"":[{""action"":""RunQuery"",""query"":""ВЫБРАТЬ 1 КАК Н""}]}";
		РезЗапрос = ИИА_Сервер.ВыполнитьDSLСценарийБезСообщений(DSLЗапрос, СсылкаДиалога);
		Результат.Детали.Добавить("RunQuery в Запрос1С: Успех=" + РезЗапрос.Успех);
		Если НЕ РезЗапрос.Успех Тогда
			Результат.Сообщение = "RunQuery должен быть разрешён: " + РезЗапрос.Сообщение;
			Возврат Результат;
		КонецЕсли;
		
		// CreateReference/SetField запрещены в Запрос1С
		DSLИзменение = "{""steps"":[{""action"":""CreateReference"",""object_name"":""Контрагенты""},{""action"":""SetField"",""field_name"":""Наименование"",""value"":""X""}]}";
		РезИзменение = ИИА_Сервер.ВыполнитьDSLСценарийБезСообщений(DSLИзменение, СсылкаДиалога);
		Результат.Детали.Добавить("CreateReference+SetField в Запрос1С: Успех=" + РезИзменение.Успех + " (ожидается Ложь)");
		Если РезИзменение.Успех Тогда
			Результат.Сообщение = "Действия изменения должны быть запрещены в режиме Запрос1С";
			Возврат Результат;
		КонецЕсли;
		
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: режим Запрос1С корректен";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест СоздатьДиалогИВыполнитьАгентаСинхронно через COM.
//
Функция ТестСоздатьДиалогИВыполнитьАгентаСинхронно() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		Рез = ИИА_ДиалогCOM.СоздатьДиалогИВыполнитьАгентаСинхронно("Администратор", "Создай контрагента Ашан", Перечисления.ИИА_ТипДиалога.Агент);
		Результат.Детали.Добавить("Диалог: " + Рез.СсылкаДиалога);
		Результат.Детали.Добавить("Успех: " + Рез.Успех);
		Если НЕ ЗначениеЗаполнено(Рез.СсылкаДиалога) Тогда
			Результат.Сообщение = "Диалог не создан";
			Возврат Результат;
		КонецЕсли;
		Если СтрДлина(Рез.Лог) = 0 Тогда
			Результат.Детали.Добавить("Лог пуст (возможно оркестратор не отработал)");
		КонецЕсли;
		Результат.Успех = Рез.Успех;
		Результат.Сообщение = ?(Рез.Успех, "Тест пройден: агент выполнен", "Агент не завершился успешно (проверьте лог)");
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест GetMetadata через DSL.
//
Функция ТестGetMetadata() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		DSL = "{""steps"":[{""action"":""GetMetadata""}]}";
		Рез = ИИА_DSL.ВыполнитьDSL(DSL, Неопределено, Ложь);
		Результат.Детали.Добавить("Выполнен GetMetadata");
		Если НЕ Рез.Успех Тогда
			Результат.Сообщение = "GetMetadata не выполнен: " + Рез.Сообщение;
			Возврат Результат;
		КонецЕсли;
		Если Рез.Результаты.Количество() = 0 Тогда
			Результат.Сообщение = "Нет результатов GetMetadata";
			Возврат Результат;
		КонецЕсли;
		РезШага = Рез.Результаты[0];
		Если НЕ РезШага.Свойство("Данные") ИЛИ РезШага.Данные = Неопределено Тогда
			Результат.Сообщение = "GetMetadata не вернул данные";
			Возврат Результат;
		КонецЕсли;
		Данные = РезШага.Данные;
		Если ТипЗнч(Данные) = Тип("Структура") И (Данные.Свойство("Справочники") ИЛИ Данные.Свойство("Документы")) Тогда
			Результат.Детали.Добавить("Получены Справочники/Документы");
		КонецЕсли;
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: GetMetadata";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест FindReferenceByName: создаём элемент, ищем по имени.
//
Функция ТестFindReferenceByName() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		УникальноеИмя = "Тест_FindRef_" + Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMddHHmmss");
		// Создаём элемент
		DSLСоздать = "{""steps"":[{""action"":""CreateReference"",""object_name"":""Контрагенты""},{""action"":""SetField"",""field_name"":""Наименование"",""value"":""" + УникальноеИмя + """},{""action"":""Write""}]}";
		РезСоздать = ИИА_DSL.ВыполнитьDSL(DSLСоздать, Неопределено, Ложь);
		Результат.Детали.Добавить("Создан элемент Контрагенты с именем " + УникальноеИмя + ": Успех=" + РезСоздать.Успех);
		Если НЕ РезСоздать.Успех Тогда
			Результат.Сообщение = "Не удалось создать элемент: " + РезСоздать.Сообщение;
			Возврат Результат;
		КонецЕсли;
		
		// Ищем по имени
		DSLНайти = "{""steps"":[{""action"":""FindReferenceByName"",""object_name"":""Контрагенты"",""name"":""" + УникальноеИмя + """}]}";
		РезНайти = ИИА_DSL.ВыполнитьDSL(DSLНайти, Неопределено, Ложь);
		Результат.Детали.Добавить("FindReferenceByName: Успех=" + РезНайти.Успех);
		Если НЕ РезНайти.Успех Тогда
			Результат.Сообщение = "FindReferenceByName не выполнен: " + РезНайти.Сообщение;
			Возврат Результат;
		КонецЕсли;
		Если РезНайти.Результаты.Количество() = 0 Тогда
			Результат.Сообщение = "FindReferenceByName не вернул результат";
			Возврат Результат;
		КонецЕсли;
		РезШага = РезНайти.Результаты[0];
		Если НЕ РезШага.Свойство("Данные") ИЛИ НЕ ЗначениеЗаполнено(РезШага.Данные) Тогда
			Результат.Сообщение = "FindReferenceByName не вернул ссылку (Данные)";
			Возврат Результат;
		КонецЕсли;
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: FindReferenceByName";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест создания объекта через DSL: создаётся контрагент, проверяется что он добавлен в таб.часть
// ИзмененныеОбъекты диалога, создан ровно 1 объект с нужным наименованием.
//
Функция ТестСозданияОбъекта() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		Наименование = "Тест_Создание_Объекта_" + Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMddHHmmss");
		Результат.Детали.Добавить("Наименование для создания: " + Наименование);
		
		// Создаём диалог
		СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог("Администратор", Перечисления.ИИА_ТипДиалога.Агент);
		Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
			Результат.Сообщение = "Не удалось создать диалог";
			Возврат Результат;
		КонецЕсли;
		Результат.Детали.Добавить("Создан диалог: " + СсылкаДиалога);
		
		// Создаём объект через DSL — ВыполнитьDSLСценарийССообщениями штатно вызывает ДобавитьИзмененныеОбъекты
		НаименованиеЭкранир = СтрЗаменить(Наименование, "\", "\\");
		НаименованиеЭкранир = СтрЗаменить(НаименованиеЭкранир, """", "\""");
		DSL = "{""steps"":[{""action"":""CreateReference"",""object_name"":""Контрагенты""},{""action"":""SetField"",""field_name"":""Наименование"",""value"":""" + НаименованиеЭкранир + """},{""action"":""Write""}]}";
		Рез = ИИА_Сервер.ВыполнитьDSLСценарийССообщениями(СсылкаДиалога, DSL);
		Результат.Детали.Добавить("DSL CreateReference+SetField+Write: Успех=" + Рез.Успех);
		Если НЕ Рез.Успех Тогда
			Результат.Сообщение = "Не удалось создать объект: " + Рез.Сообщение;
			Возврат Результат;
		КонецЕсли;
		
		// Проверяем, что объект добавлен в таб.часть ИзмененныеОбъекты диалога
		Диалог = СсылкаДиалога.ПолучитьОбъект();
		Если Диалог = Неопределено Тогда
			Результат.Сообщение = "Не удалось получить объект диалога";
			Возврат Результат;
		КонецЕсли;
		
		КоличествоВИзмененных = 0;
		СсылкаСоздан = Неопределено;
		Для Каждого СтрокаИзмененных Из Диалог.ИзмененныеОбъекты Цикл
			Если ЗначениеЗаполнено(СтрокаИзмененных.СсылкаНаОбъект) Тогда
				КоличествоВИзмененных = КоличествоВИзмененных + 1;
				СсылкаСоздан = СтрокаИзмененных.СсылкаНаОбъект;
			КонецЕсли;
		КонецЦикла;
		
		Результат.Детали.Добавить("Строк в ИзмененныеОбъекты: " + КоличествоВИзмененных);
		Если КоличествоВИзмененных <> 1 Тогда
			Результат.Сообщение = "Ожидалась 1 запись в ИзмененныеОбъекты, найдено: " + КоличествоВИзмененных;
			Возврат Результат;
		КонецЕсли;
		
		// Проверяем, что создан ровно 1 объект с таким наименованием
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	Справочник.Контрагенты КАК Элементы
		|ГДЕ
		|	Элементы.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", Наименование);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		Количество = Выборка.Количество;
		Результат.Детали.Добавить("Найдено объектов с именем '" + Наименование + "': " + Количество);
		
		Если Количество <> 1 Тогда
			Результат.Сообщение = "Ожидался 1 объект с именем '" + Наименование + "', найдено: " + Количество;
			Возврат Результат;
		КонецЕсли;
		
		// Проверяем наименование у объекта из ИзмененныеОбъекты
		Если ЗначениеЗаполнено(СсылкаСоздан) Тогда
			ОбъектСоздан = СсылкаСоздан.ПолучитьОбъект();
			Если ОбъектСоздан <> Неопределено Тогда
				НаименованиеОбъекта = СокрЛП(Строка(ОбъектСоздан.Наименование));
				Если НаименованиеОбъекта <> Наименование Тогда
					Результат.Сообщение = "Наименование объекта не совпадает: '" + НаименованиеОбъекта + "' <> '" + Наименование + "'";
					Возврат Результат;
				КонецЕсли;
				Результат.Детали.Добавить("Наименование объекта совпадает");
			КонецЕсли;
		КонецЕсли;
		
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: создан 1 объект, добавлен в ИзмененныеОбъекты, наименование '" + Наименование + "'";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест логирования диалога: ДобавитьЗаписьВЛогДиалога, ПолучитьЛогДиалога.
//
Функция ТестЛогированияДиалога() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог("Администратор", Перечисления.ИИА_ТипДиалога.Агент);
		Результат.Детали.Добавить("Создан диалог");
		Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
			Результат.Сообщение = "Не удалось создать диалог";
			Возврат Результат;
		КонецЕсли;
		
		МеткаТест = "ТестЛог_" + Строка(Новый УникальныйИдентификатор());
		ЗаписьТест = МеткаТест;
		ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, ЗаписьТест);
		Результат.Детали.Добавить("Добавлена запись в лог");
		
		Лог = ИИА_Сервер.ПолучитьЛогДиалога(СсылкаДиалога);
		Если СтрНайти(Лог, МеткаТест) = 0 Тогда
			Результат.Сообщение = "Добавленная запись не найдена в логе (искали '" + МеткаТест + "')";
			Возврат Результат;
		КонецЕсли;
		Результат.Детали.Добавить("Запись найдена в логе");
		
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: логирование диалога";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест промпта дополнения плана: проверка структуры ПолучитьПромптДополненияПлана.
//
Функция ТестПромптаДополненияПлана() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		ПланJSON = "[{""Задача"":""CreateReference"",""Выполнена"":true,""Результат"":""Создан""}]";
		ТекстЗадачи = "Добавь комментарий";
		
		// 1. Базовый вызов без диалога (без контекста ИзмененныеОбъекты)
		ПромптБезКонтекста = ИИА_Промты.ПолучитьПромптДополненияПлана(ТекстЗадачи, ПланJSON, Неопределено);
		Результат.Детали.Добавить("Промпт без контекста: длина " + СтрДлина(ПромптБезКонтекста));
		
		Если СтрНайти(ПромптБезКонтекста, "Новая задача пользователя:") = 0 Тогда
			Результат.Сообщение = "Промпт не содержит 'Новая задача пользователя:'";
			Возврат Результат;
		КонецЕсли;
		Если СтрНайти(ПромптБезКонтекста, ПланJSON) = 0 Тогда
			Результат.Сообщение = "Промпт не содержит ПланJSON";
			Возврат Результат;
		КонецЕсли;
		Если СтрНайти(ПромптБезКонтекста, "JSON массив") = 0 Тогда
			Результат.Сообщение = "Промпт не содержит инструкцию про JSON массив";
			Возврат Результат;
		КонецЕсли;
		
		// 2. Вызов с диалогом, имеющим ИзмененныеОбъекты
		СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог("Администратор", Перечисления.ИИА_ТипДиалога.Агент);
		Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
			Результат.Сообщение = "Не удалось создать диалог";
			Возврат Результат;
		КонецЕсли;
		
		// Добавляем объект в ИзмененныеОбъекты
		Диалог = СсылкаДиалога.ПолучитьОбъект();
		НоваяСтрока = Диалог.ИзмененныеОбъекты.Добавить();
		НоваяСтрока.СсылкаНаОбъект = СсылкаДиалога;
		Диалог.Записать();
		
		ПромптСКонтекстом = ИИА_Промты.ПолучитьПромптДополненияПлана(ТекстЗадачи, ПланJSON, СсылкаДиалога);
		Результат.Детали.Добавить("Промпт с контекстом: длина " + СтрДлина(ПромптСКонтекстом));
		
		Если СтрНайти(ПромптСКонтекстом, "Контекст диалога") = 0 Тогда
			Результат.Сообщение = "Промпт с ИзмененныеОбъекты не содержит блок 'Контекст диалога'";
			Возврат Результат;
		КонецЕсли;
		
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: промпт дополнения плана";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест логов после дополнения плана (режим холостого хода с mock).
//
Функция ТестЛоговПослеДополненияПлана() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог("Администратор", Перечисления.ИИА_ТипДиалога.Агент);
		Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
			Результат.Сообщение = "Не удалось создать диалог";
			Возврат Результат;
		КонецЕсли;
		Результат.Детали.Добавить("Создан диалог: " + СсылкаДиалога);
		
		// План с одной выполненной задачей
		Диалог = СсылкаДиалога.ПолучитьОбъект();
		СтрокаПлана = Диалог.План.Добавить();
		СтрокаПлана.Задача = "CreateReference";
		СтрокаПлана.Выполнена = Истина;
		СтрокаПлана.Результат = "Создан";
		Диалог.Записать();
		
		// Mock-ответ ДО отправки (ОтправитьСообщениеСервера вызовет ДополнитьПлан при ПланЗавершен)
		// Формат: JSON массив строк (новые задачи)
		MockТекст = "[""SetField"",""Write""]";
		МассивMock = Новый Массив;
		МассивMock.Добавить(Новый Структура("Текст", MockТекст));
		ИИА_Сервер.УстановитьОчередьMockОтветов(СсылкаДиалога, МассивMock);
		Результат.Детали.Добавить("Установлена очередь mock-ответов");
		
		// Сообщение пользователя (при ПланЗавершен вызовет ДополнитьПлан с mock)
		ИИА_Сервер.ОтправитьСообщениеСервера(СсылкаДиалога, Перечисления.ИИА_ТипДиалога.Агент, "Добавь комментарий");
		Результат.Детали.Добавить("Добавлено сообщение пользователя");
		
		// Дополнить план
		УспехДополнения = ИИА_Оркестратор.ДополнитьПлан(СсылкаДиалога);
		Результат.Детали.Добавить("ДополнитьПлан: Успех=" + УспехДополнения);
		
		ИИА_Сервер.ОчиститьОчередьMockОтветов(СсылкаДиалога);
		
		Лог = ИИА_Сервер.ПолучитьЛогДиалога(СсылкаДиалога);
		// Префикс [План] убирается при записи в лог, остаётся текст после скобок
		Если СтрНайти(Лог, "Дополнение плана новой задачей") = 0 Тогда
			Результат.Сообщение = "Лог не содержит 'Дополнение плана новой задачей'";
			Возврат Результат;
		КонецЕсли;
		Если СтрНайти(Лог, "План дополнен") = 0 Тогда
			Результат.Сообщение = "Лог не содержит 'План дополнен'";
			Возврат Результат;
		КонецЕсли;
		
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: логи после дополнения плана";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест дополнения плана с контекстом: создаём объект, добавляем в ИзмененныеОбъекты, дополняем план mock-ом.
//
Функция ТестДополнениеПланаСКонтекстомОбъекта() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		Наименование = "Тест_Дополнение_Контекст_" + Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMddHHmmss");
		СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог("Администратор", Перечисления.ИИА_ТипДиалога.Агент);
		Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
			Результат.Сообщение = "Не удалось создать диалог";
			Возврат Результат;
		КонецЕсли;
		
		// Создаём контрагента через DSL, добавляется в ИзмененныеОбъекты
		НаименованиеЭкранир = СтрЗаменить(Наименование, "\", "\\");
		НаименованиеЭкранир = СтрЗаменить(НаименованиеЭкранир, """", "\""");
		DSL = "{""steps"":[{""action"":""CreateReference"",""object_name"":""Контрагенты""},{""action"":""SetField"",""field_name"":""Наименование"",""value"":""" + НаименованиеЭкранир + """},{""action"":""Write""}]}";
		Рез = ИИА_Сервер.ВыполнитьDSLСценарийССообщениями(СсылкаДиалога, DSL);
		Если НЕ Рез.Успех Тогда
			Результат.Сообщение = "Не удалось создать объект: " + Рез.Сообщение;
			Возврат Результат;
		КонецЕсли;
		
		// План с выполненной задачей
		Диалог = СсылкаДиалога.ПолучитьОбъект();
		СтрокаПлана = Диалог.План.Добавить();
		СтрокаПлана.Задача = "CreateReference";
		СтрокаПлана.Выполнена = Истина;
		СтрокаПлана.Результат = "Создан";
		Диалог.Записать();
		
		// Проверяем, что объект в ИзмененныеОбъекты
		Диалог = СсылкаДиалога.ПолучитьОбъект();
		КоличествоВИзмененных = 0;
		Для Каждого СтрокаИзмененных Из Диалог.ИзмененныеОбъекты Цикл
			Если ЗначениеЗаполнено(СтрокаИзмененных.СсылкаНаОбъект) Тогда
				КоличествоВИзмененных = КоличествоВИзмененных + 1;
			КонецЕсли;
		КонецЦикла;
		Если КоличествоВИзмененных = 0 Тогда
			Результат.Сообщение = "ИзмененныеОбъекты пуст после создания";
			Возврат Результат;
		КонецЕсли;
		
		// Mock и дополнение
		MockТекст = "[""SetField"",""Write""]";
		МассивMock = Новый Массив;
		МассивMock.Добавить(Новый Структура("Текст", MockТекст));
		ИИА_Сервер.УстановитьОчередьMockОтветов(СсылкаДиалога, МассивMock);
		ИИА_Сервер.ОтправитьСообщениеСервера(СсылкаДиалога, Перечисления.ИИА_ТипДиалога.Агент, "заполни ему комментарий Тест");
		ИИА_Сервер.ОчиститьОчередьMockОтветов(СсылкаДиалога);
		
		// Проверяем, что план дополнен
		Диалог = СсылкаДиалога.ПолучитьОбъект();
		КоличествоЗадач = Диалог.План.Количество();
		Если КоличествоЗадач < 2 Тогда
			Результат.Сообщение = "План не дополнен: " + КоличествоЗадач + " задач";
			Возврат Результат;
		КонецЕсли;
		
		// Проверяем, что промпт содержал контекст (через повторный вызов ПолучитьПромптДополненияПлана — контекст уже есть)
		ПланJSON = "[{""Задача"":""CreateReference"",""Выполнена"":true,""Результат"":""Создан""}]";
		Промпт = ИИА_Промты.ПолучитьПромптДополненияПлана("заполни ему комментарий", ПланJSON, СсылкаДиалога);
		Если СтрНайти(Промпт, "Контекст диалога") = 0 Тогда
			Результат.Сообщение = "Промпт с ИзмененныеОбъекты не содержит 'Контекст диалога'";
			Возврат Результат;
		КонецЕсли;
		
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: дополнение плана с контекстом объекта";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест контекста из регистра (ХранилищеЗначений) для дополнения плана.
//
Функция ТестКонтекстИзРегистраДляДополнения() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		Наименование = "Тест_Регистр_" + Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMddHHmmss");
		СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог("Администратор", Перечисления.ИИА_ТипДиалога.Агент);
		Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
			Результат.Сообщение = "Не удалось создать диалог";
			Возврат Результат;
		КонецЕсли;
		
		// Создаём контрагента и записываем в регистр DSL_СсылкаОбъекта
		НаименованиеЭкранир = СтрЗаменить(Наименование, "\", "\\");
		НаименованиеЭкранир = СтрЗаменить(НаименованиеЭкранир, """", "\""");
		DSL = "{""steps"":[{""action"":""CreateReference"",""object_name"":""Контрагенты""},{""action"":""SetField"",""field_name"":""Наименование"",""value"":""" + НаименованиеЭкранир + """},{""action"":""Write""}]}";
		Рез = ИИА_Сервер.ВыполнитьDSLСценарийССообщениями(СсылкаДиалога, DSL);
		Если НЕ Рез.Успех Тогда
			Результат.Сообщение = "Не удалось создать объект: " + Рез.Сообщение;
			Возврат Результат;
		КонецЕсли;
		
		// Промпт дополнения должен содержать контекст из регистра (Текущий объект в контексте DSL)
		ПланJSON = "[{""Задача"":""CreateReference"",""Выполнена"":true,""Результат"":""Создан""}]";
		Промпт = ИИА_Промты.ПолучитьПромптДополненияПлана("заполни ему комментарий", ПланJSON, СсылкаДиалога);
		
		// СформироватьКонтекстИзРегистраДиалога возвращает "Текущий объект в контексте DSL", СформироватьКонтекстИзмененныхОбъектов — "Контекст диалога"
		Если СтрНайти(Промпт, "Текущий объект в контексте DSL") > 0 ИЛИ СтрНайти(Промпт, "Контекст диалога") > 0 Тогда
			Результат.Детали.Добавить("Промпт содержит контекст из регистра или ИзмененныеОбъекты");
		Иначе
			Результат.Сообщение = "Промпт не содержит контекст из регистра или ИзмененныеОбъекты";
			Возврат Результат;
		КонецЕсли;
		
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: контекст из регистра для дополнения";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест промпта создания плана с контекстом ИзмененныеОбъекты.
//
Функция ТестПромптаСозданияПланаСКонтекстом() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог("Администратор", Перечисления.ИИА_ТипДиалога.Агент);
		Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
			Результат.Сообщение = "Не удалось создать диалог";
			Возврат Результат;
		КонецЕсли;
		
		// Добавляем объект в ИзмененныеОбъекты
		Диалог = СсылкаДиалога.ПолучитьОбъект();
		НоваяСтрока = Диалог.ИзмененныеОбъекты.Добавить();
		НоваяСтрока.СсылкаНаОбъект = СсылкаДиалога;
		Диалог.Записать();
		
		Промпт = ИИА_Промты.ПолучитьПромптСозданияПлана("заполни ему комментарий", СсылкаДиалога);
		
		Если СтрНайти(Промпт, "Контекст диалога") = 0 Тогда
			Результат.Сообщение = "Промпт создания плана не содержит 'Контекст диалога'";
			Возврат Результат;
		КонецЕсли;
		Если СтрНайти(Промпт, "Задача:") = 0 Тогда
			Результат.Сообщение = "Промпт не содержит 'Задача:'";
			Возврат Результат;
		КонецЕсли;
		
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: промпт создания плана с контекстом";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест СобратьФактыПоследнихДействий.
//
Функция ТестСобратьФактыПоследнихДействий() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог("Администратор", Перечисления.ИИА_ТипДиалога.Агент);
		Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
			Результат.Сообщение = "Не удалось создать диалог";
			Возврат Результат;
		КонецЕсли;
		
		// Добавляем сообщение с dsl_system_result (имитация результата DSL)
		ТекстРезультата = "dsl_system_result success=true CreateReference Контрагенты";
		ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.Система, Перечисления.ИИА_ТипСообщения.Текст, ТекстРезультата);
		
		Факты = ИИА_Оркестратор.СобратьФактыПоследнихДействий(СсылкаДиалога);
		
		Если ПустаяСтрока(Факты) Тогда
			Результат.Сообщение = "СобратьФактыПоследнихДействий вернул пустую строку";
			Возврат Результат;
		КонецЕсли;
		// Форматирование может дать "DSL Result: ok | ..." - проверяем наличие маркеров
		ФактыВРег = ВРег(Факты);
		Если СтрНайти(ФактыВРег, "DSL") = 0 И СтрНайти(ФактыВРег, "CREATEREFERENCE") = 0 Тогда
			Результат.Сообщение = "Факты не содержат ожидаемых данных (DSL или CreateReference)";
			Возврат Результат;
		КонецЕсли;
		
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: СобратьФактыПоследнихДействий";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест создания объекта и последующего изменения через контекст регистра.
//
Функция ТестСозданиеИИзменениеОбъекта() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		Наименование = "Тест_Создание_Изменение_" + Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMddHHmmss");
		КомментарийТест = "Комментарий из теста";
		СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог("Администратор", Перечисления.ИИА_ТипДиалога.Агент);
		Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
			Результат.Сообщение = "Не удалось создать диалог";
			Возврат Результат;
		КонецЕсли;
		
		// 1. Создаём контрагента (DSL пишет DSL_СсылкаОбъекта в регистр)
		НаименованиеЭкранир = СтрЗаменить(Наименование, "\", "\\");
		НаименованиеЭкранир = СтрЗаменить(НаименованиеЭкранир, """", "\""");
		DSL1 = "{""steps"":[{""action"":""CreateReference"",""object_name"":""Контрагенты""},{""action"":""SetField"",""field_name"":""Наименование"",""value"":""" + НаименованиеЭкранир + """},{""action"":""Write""}]}";
		Рез1 = ИИА_Сервер.ВыполнитьDSLСценарийССообщениями(СсылкаДиалога, DSL1);
		Если НЕ Рез1.Успех Тогда
			Результат.Сообщение = "Не удалось создать объект: " + Рез1.Сообщение;
			Возврат Результат;
		КонецЕсли;
		
		// 2. Изменяем через контекст регистра (SetField + Write без CreateReference)
		КомментарийЭкранир = СтрЗаменить(КомментарийТест, "\", "\\");
		КомментарийЭкранир = СтрЗаменить(КомментарийЭкранир, """", "\""");
		DSL2 = "{""steps"":[{""action"":""SetField"",""field_name"":""Комментарий"",""value"":""" + КомментарийЭкранир + """},{""action"":""Write""}]}";
		Рез2 = ИИА_Сервер.ВыполнитьDSLСценарийССообщениями(СсылкаДиалога, DSL2);
		Если НЕ Рез2.Успех Тогда
			Результат.Сообщение = "Не удалось изменить объект: " + Рез2.Сообщение + " (проверьте наличие реквизита Комментарий у Контрагенты)";
			Возврат Результат;
		КонецЕсли;
		
		// 3. Проверяем, что объект создан и комментарий установлен
		Диалог = СсылкаДиалога.ПолучитьОбъект();
		СсылкаСоздан = Неопределено;
		Для Каждого СтрокаИзмененных Из Диалог.ИзмененныеОбъекты Цикл
			Если ЗначениеЗаполнено(СтрокаИзмененных.СсылкаНаОбъект) Тогда
				СсылкаСоздан = СтрокаИзмененных.СсылкаНаОбъект;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЗначениеЗаполнено(СсылкаСоздан) Тогда
			Результат.Сообщение = "Не найден объект в ИзмененныеОбъекты";
			Возврат Результат;
		КонецЕсли;
		
		Объект = СсылкаСоздан.ПолучитьОбъект();
		Если Объект = Неопределено Тогда
			Результат.Сообщение = "Не удалось получить объект";
			Возврат Результат;
		КонецЕсли;
		
		Попытка
			КомментарийФакт = СокрЛП(Строка(Объект.Комментарий));
		Исключение
			Результат.Сообщение = "Реквизит Комментарий отсутствует у Контрагенты";
			Возврат Результат;
		КонецПопытки;
		
		Если КомментарийФакт <> КомментарийТест Тогда
			Результат.Сообщение = "Комментарий не совпадает: '" + КомментарийФакт + "' <> '" + КомментарийТест + "'";
			Возврат Результат;
		КонецЕсли;
		
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: создание и изменение объекта через контекст";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Тест полного цикла агента в режиме холостого хода (mock для плана, DSL, обновления плана, проверки, summary).
//
Функция ТестПолныйЦиклАгентаХолостойХод() Экспорт
	Результат = СформироватьРезультатТеста(Ложь, "", Новый Массив);
	Попытка
		Наименование = "Тест_ПолныйЦикл_" + Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMddHHmmss");
		СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог("Администратор", Перечисления.ИИА_ТипДиалога.Агент);
		Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
			Результат.Сообщение = "Не удалось создать диалог";
			Возврат Результат;
		КонецЕсли;
		
		НаименованиеЭкранир = СтрЗаменить(Наименование, "\", "\\");
		НаименованиеЭкранир = СтрЗаменить(НаименованиеЭкранир, """", "\""");
		DSLШаг1 = "{""steps"":[{""action"":""CreateReference"",""object_name"":""Контрагенты""},{""action"":""SetField"",""field_name"":""Наименование"",""value"":""" + НаименованиеЭкранир + """},{""action"":""Write""}]}";
		ПланОбновленный = "[{""Задача"":""CreateReference"",""Выполнена"":true,""Результат"":""Создан""},{""Задача"":""SetField"",""Выполнена"":true,""Результат"":""Установлено""},{""Задача"":""Write"",""Выполнена"":true,""Результат"":""Записан""}]";
		
		// Очередь mock: 1) план, 2) DSL, 3) обновление плана, 4) проверка (dsl), 5) summary (text)
		МассивMock = Новый Массив;
		МассивMock.Добавить(Новый Структура("Текст", "[""CreateReference"",""SetField"",""Write""]"));
		МассивMock.Добавить(Новый Структура("Текст, DSL", DSLШаг1, DSLШаг1));
		МассивMock.Добавить(Новый Структура("Текст", ПланОбновленный));
		МассивMock.Добавить(Новый Структура("Текст", "Да"));
		МассивMock.Добавить(Новый Структура("Текст", "Создан контрагент " + Наименование));
		ИИА_Сервер.УстановитьОчередьMockОтветов(СсылкаДиалога, МассивMock);
		
		ИИА_Сервер.ОтправитьСообщениеСервера(СсылкаДиалога, Перечисления.ИИА_ТипДиалога.Агент, "Создай контрагента " + Наименование);
		ИИА_Сервер.УстановитьОркестраторВключен(СсылкаДиалога, Истина);
		НачальныеТокены = ИИА_Сервер.ПолучитьОбщееКоличествоТокенов(СсылкаДиалога);
		ИИА_Оркестратор.ВыполнитьЦикл(СсылкаДиалога, НачальныеТокены);
		
		ИИА_Сервер.ОчиститьОчередьMockОтветов(СсылкаДиалога);
		
		// Проверяем завершение
		Если ИИА_Сервер.ОркестраторВключенДляДиалога(СсылкаДиалога) Тогда
			Результат.Сообщение = "Оркестратор не завершился";
			Возврат Результат;
		КонецЕсли;
		
		// Проверяем, что объект создан
		Диалог = СсылкаДиалога.ПолучитьОбъект();
		КоличествоВИзмененных = 0;
		Для Каждого СтрокаИзмененных Из Диалог.ИзмененныеОбъекты Цикл
			Если ЗначениеЗаполнено(СтрокаИзмененных.СсылкаНаОбъект) Тогда
				КоличествоВИзмененных = КоличествоВИзмененных + 1;
			КонецЕсли;
		КонецЦикла;
		Если КоличествоВИзмененных = 0 Тогда
			Результат.Сообщение = "ИзмененныеОбъекты пуст после цикла";
			Возврат Результат;
		КонецЕсли;
		
		Результат.Успех = Истина;
		Результат.Сообщение = "Тест пройден: полный цикл агента в холостом ходу";
	Исключение
		Результат.Сообщение = "Ошибка: " + ОписаниеОшибки();
		Результат.Детали.Добавить(Результат.Сообщение);
	КонецПопытки;
	Возврат Результат;
КонецФункции

#КонецОбласти
